Repository: phpgao/BrowserRouter
Catalog: BrowserRouter/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

source: * — matches a single level (no `.` or `/`)
ja: * — 単一レベルに一致（`.` と `/` を含まない）
zh_hans: * — 匹配单级（不含 `.` 和 `/`）
zh_hant: * — 匹配單層（不含 `.` 和 `/`）

source: ** — matches multiple levels (including `.` and `/`)
ja: ** — 複数レベルに一致（`.` と `/` を含む）
zh_hans: ** — 匹配多级（包含 `.` 和 `/`）
zh_hant: ** — 匹配多層（包含 `.` 和 `/`）

source: %lld browser(s) not found, reassigned to fallback.
ja: %lld 件のブラウザが見つからず、フォールバックに再割り当てしました。
zh_hans: %lld 个浏览器未找到，已重新分配到兜底浏览器。
zh_hant: %lld 個瀏覽器未找到，已重新分配到備用瀏覽器。

source: %lld clicks
ja: %lld 回クリック
zh_hans: %lld 次点击
zh_hant: %lld 次點擊

source: %lld duplicate(s) skipped.
ja: %lld 件の重複ルールをスキップしました。
zh_hans: %lld 条重复规则已跳过。
zh_hant: %lld 條重複規則已跳過。

source: %lld rule(s) imported.
ja: %lld 件のルールをインポートしました。
zh_hans: 已导入 %lld 条规则。
zh_hant: 已匯入 %lld 條規則。

source: %lld rule(s) matched. Reorder disabled during filtering.
ja: %lld 件のルールが一致。フィルタ中は並べ替え無効。
zh_hans: %lld 条规则匹配。筛选期间禁用排序。
zh_hant: %lld 條規則匹配。篩選期間禁用排序。

source: %lld selected
ja: %lld 件選択中
zh_hans: 已选择 %lld 项
zh_hant: 已選擇 %lld 項

source: A lightweight macOS app that routes URLs to different browsers based on rules.
ja: ルールに基づいてURLを異なるブラウザにルーティングする軽量なmacOSアプリ。
zh_hans: 一款轻量级 macOS 应用，根据规则将 URL 路由到不同的浏览器。
zh_hant: 一款輕量級 macOS 應用程式，根據規則將 URL 路由到不同的瀏覽器。

source: About
ja: について
zh_hans: 关于
zh_hant: 關於

source: Add
ja: 追加
zh_hans: 添加
zh_hant: 新增

source: Add %lld Rule(s)
ja: %lld 件のルールを追加
zh_hans: 添加 %lld 条规则
zh_hant: 新增 %lld 條規則

source: Add Rule
ja: ルールを追加
zh_hans: 添加规则
zh_hant: 新增規則

source: Add Rule for this URL
ja: このURLにルールを追加
zh_hans: 为此 URL 添加规则
zh_hant: 為此 URL 新增規則

source: Add Rules
ja: ルールを追加
zh_hans: 添加规则
zh_hant: 新增規則

source: All
ja: すべて
zh_hans: 全部
zh_hant: 全部

source: Apply
ja: 適用
zh_hans: 应用
zh_hant: 套用

source: Are you sure you want to delete %lld selected rules? This cannot be undone.
ja: 選択した %lld 件のルールを削除しますか？この操作は元に戻せません。
zh_hans: 确定要删除 %lld 条选中的规则吗？此操作无法撤销。
zh_hant: 確定要刪除 %lld 條選中的規則嗎？此操作無法撤銷。

source: Browser Not Found
ja: ブラウザが見つかりません
zh_hans: 未找到浏览器
zh_hant: 找不到瀏覽器

source: Browser:
ja: ブラウザ：
zh_hans: 浏览器：
zh_hant: 瀏覽器：

source: BrowserRouter Preferences
ja: BrowserRouter 環境設定
zh_hans: BrowserRouter 偏好设置
zh_hant: BrowserRouter 偏好設定

source: Browsers
ja: ブラウザ
zh_hans: 浏览器
zh_hant: 瀏覽器

source: Cancel
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

source: Click + Add to create URL routing rules.
ja: 「+ 追加」をクリックしてURLルーティングルールを作成します。
zh_hans: 点击 + 添加创建 URL 路由规则。
zh_hant: 點擊 + 新增建立 URL 路由規則。

source: Confirm Deletion
ja: 削除の確認
zh_hans: 确认删除
zh_hant: 確認刪除

source: Copy Pattern
ja: パターンをコピー
zh_hans: 拷贝规则
zh_hant: 拷貝規則

source: Could Not Set Default Browser
ja: デフォルトブラウザを設定できません
zh_hans: 无法设置默认浏览器
zh_hant: 無法設定預設瀏覽器

source: Currently set as default
ja: 現在デフォルトに設定済み
zh_hans: 当前已设为默认
zh_hant: 目前已設為預設

source: Default Browser
ja: デフォルトブラウザ
zh_hans: 默认浏览器
zh_hant: 預設瀏覽器

source: Delete
ja: 削除
zh_hans: 删除
zh_hant: 刪除

source: Delete %lld
ja: %lld 件を削除
zh_hans: 删除 %lld 项
zh_hant: 刪除 %lld 項

source: Delete %lld Rules
ja: %lld 件のルールを削除
zh_hans: 删除 %lld 条规则
zh_hant: 刪除 %lld 條規則

source: Deselect All
ja: 選択解除
zh_hans: 取消全选
zh_hant: 取消全選

source: Disable
ja: 無効化
zh_hans: 禁用
zh_hant: 停用

source: Disable %lld Rules
ja: %lld 件のルールを無効化
zh_hans: 禁用 %lld 条规则
zh_hant: 停用 %lld 條規則

source: Drag to reorder ↕
ja: ドラッグで並べ替え ↕
zh_hans: 拖拽排序 ↕
zh_hant: 拖曳排序 ↕

source: Drag to reorder. Uncheck to hide from the browser picker.
ja: ドラッグで並べ替え。チェックを外すとブラウザ選択から非表示になります。
zh_hans: 拖拽排序。取消勾选可从浏览器选择器中隐藏。
zh_hant: 拖曳排序。取消勾選可從瀏覽器選擇器中隱藏。

source: Edit Rule
ja: ルールを編集
zh_hans: 编辑规则
zh_hant: 編輯規則

source: Edit…
ja: 編集…
zh_hans: 编辑…
zh_hant: 編輯…

source: Enable
ja: 有効化
zh_hans: 启用
zh_hant: 啟用

source: Enable %lld Rules
ja: %lld 件のルールを有効化
zh_hans: 启用 %lld 条规则
zh_hant: 啟用 %lld 條規則

source: Enable hover-to-incognito in browser picker
ja: ブラウザ選択でホバーしてシークレットモードを有効化
zh_hans: 在浏览器选择器中启用悬停进入隐身模式
zh_hant: 在瀏覽器選擇器中啟用懸停進入隱身模式

source: Export
ja: エクスポート
zh_hans: 导出
zh_hant: 匯出

source: Export Rules
ja: ルールをエクスポート
zh_hans: 导出规则
zh_hant: 匯出規則

source: Fallback Behavior
ja: フォールバック動作
zh_hans: 后备行为
zh_hant: 後備行為

source: Fallback Browser
ja: フォールバックブラウザ
zh_hans: 兜底浏览器
zh_hant: 備用瀏覽器

source: Filter by browser:
ja: ブラウザで絞り込み：
zh_hans: 按浏览器筛选：
zh_hant: 按瀏覽器篩選：

source: Filtering — clear URL to reorder
ja: フィルタ中 — URLをクリアして並べ替えを有効化
zh_hans: 筛选中 — 清空 URL 以恢复排序
zh_hant: 篩選中 — 清空 URL 以恢復排序

source: General
ja: 一般
zh_hans: 通用
zh_hant: 一般

source: Hold your cursor over a browser icon to switch to incognito mode before clicking.
ja: ブラウザアイコンにカーソルを合わせると、クリック前にシークレットモードに切り替わります。
zh_hans: 将光标悬停在浏览器图标上，点击前可切换至隐身模式。
zh_hant: 將游標懸停在瀏覽器圖示上，點擊前可切換至隱身模式。

source: Hover delay:
ja: ホバー遅延：
zh_hans: 悬停延迟：
zh_hant: 懸停延遲：

source: If imported rules reference a browser not installed on this Mac, they will be reassigned to:
ja: インポートしたルールが未インストールのブラウザを参照している場合、次のブラウザに再割り当てされます：
zh_hans: 如果导入的规则引用了本机未安装的浏览器，将被重新分配到：
zh_hant: 如果匯入的規則參照了本機未安裝的瀏覽器，將被重新分配到：

source: Import
ja: インポート
zh_hans: 导入
zh_hant: 匯入

source: Import Complete
ja: インポート完了
zh_hans: 导入完成
zh_hant: 匯入完成

source: Import Mode
ja: インポートモード
zh_hans: 导入模式
zh_hant: 匯入模式

source: Import Rules
ja: ルールをインポート
zh_hans: 导入规则
zh_hant: 匯入規則

source: Incognito
ja: シークレット
zh_hans: 隐身
zh_hant: 隱身

source: Incognito Mode
ja: シークレットモード
zh_hans: 隐身模式
zh_hant: 隱身模式

source: Keep existing rules and add new ones (duplicates skipped).
ja: 既存のルールを保持し、新しいルールを追加します（重複はスキップ）。
zh_hans: 保留现有规则并添加新规则（重复的将被跳过）。
zh_hant: 保留現有規則並新增新規則（重複的將被跳過）。

source: Language
ja: 言語
zh_hans: 语言
zh_hant: 語言

source: Later
ja: 後で
zh_hans: 稍后
zh_hant: 稍後

source: Launch at Login
ja: ログイン時に起動
zh_hans: 登录时启动
zh_hant: 登入時啟動

source: Match
ja: 一致
zh_hans: 匹配
zh_hant: 匹配

source: Merge
ja: マージ
zh_hans: 合并
zh_hant: 合併

source: No rules matched this URL.
ja: このURLに一致するルールがありません。
zh_hans: 没有规则匹配此 URL。
zh_hant: 沒有規則匹配此 URL。

source: No rules yet
ja: ルールがありません
zh_hans: 暂无规则
zh_hant: 尚無規則

source: No supported browsers detected. Please install a browser.
ja: 対応ブラウザが検出されません。ブラウザをインストールしてください。
zh_hans: 未检测到支持的浏览器，请安装浏览器。
zh_hant: 未偵測到支援的瀏覽器，請安裝瀏覽器。

source: Open in specific browser
ja: 指定ブラウザで開く
zh_hans: 在指定浏览器中打开
zh_hant: 在指定瀏覽器中開啟

source: Open Preferences
ja: 環境設定を開く
zh_hans: 打开偏好设置
zh_hant: 開啟偏好設定

source: Open Preferences…
ja: 環境設定を開く…
zh_hans: 打开偏好设置…
zh_hant: 開啟偏好設定…

source: Open with
ja: 使用するブラウザ
zh_hans: 打开方式
zh_hant: 開啟方式

source: Path matching — use `/` to match URL paths
ja: パス一致 — `/` でURLパスを一致させます
zh_hans: 路径匹配 — 使用 `/` 匹配 URL 路径
zh_hant: 路徑匹配 — 使用 `/` 匹配 URL 路徑

source: Pattern
ja: パターン
zh_hans: 模式
zh_hant: 模式

source: Please set BrowserRouter manually in System Settings → Desktop & Dock → Default web browser.
ja: システム設定 → デスクトップとDock → デフォルトのWebブラウザで手動設定してください。
zh_hans: 请在系统设置 → 桌面与程序坞 → 默认网页浏览器中手动设置 BrowserRouter。
zh_hant: 請在系統設定 → 桌面與 Dock → 預設網頁瀏覽器中手動設定 BrowserRouter。

source: Query matching — use `?` to match query parameters
ja: クエリ一致 — `?` でクエリパラメータを一致させます
zh_hans: 参数匹配 — 使用 `?` 匹配查询参数
zh_hant: 參數匹配 — 使用 `?` 匹配查詢參數

source: Quick Add Rule
ja: クイックルール追加
zh_hans: 快速添加规则
zh_hant: 快速新增規則

source: Quit BrowserRouter
ja: BrowserRouter を終了
zh_hans: 退出 BrowserRouter
zh_hant: 結束 BrowserRouter

source: Remove all existing rules and import.
ja: 既存のルールをすべて削除してインポートします。
zh_hans: 清除所有现有规则并导入。
zh_hant: 清除所有現有規則並匯入。

source: Replace
ja: 置換
zh_hans: 替换
zh_hant: 替換

source: Reset Click Stats
ja: クリック統計をリセット
zh_hans: 清除点击统计
zh_hant: 清除點擊統計

source: Restart Now
ja: 今すぐ再起動
zh_hans: 立即重启
zh_hant: 立即重新啟動

source: Restart Required
ja: 再起動が必要です
zh_hans: 需要重启
zh_hant: 需要重新啟動

source: Rules
ja: ルール
zh_hans: 规则
zh_hant: 規則

source: Rules targeting browsers not installed on this Mac will be automatically disabled.
ja: 未インストールのブラウザを対象とするルールは自動的に無効化されます。
zh_hans: 目标浏览器未安装的规则将自动禁用。
zh_hant: 目標瀏覽器未安裝的規則將自動停用。

source: Save
ja: 保存
zh_hans: 保存
zh_hant: 儲存

source: Select All
ja: すべて選択
zh_hans: 全选
zh_hant: 全選

source: Set as Default
ja: デフォルトに設定
zh_hans: 设为默认
zh_hant: 設為預設

source: Show browser picker
ja: ブラウザ選択を表示
zh_hans: 显示浏览器选择器
zh_hant: 顯示瀏覽器選擇器

source: Show quick-add rule button in picker
ja: ピッカーにクイック追加ボタンを表示
zh_hans: 在选择器中显示快速添加规则按钮
zh_hant: 在選擇器中顯示快速新增規則按鈕

source: Supported browsers: Chrome, Chrome Canary, Chromium, Edge, Firefox, Brave, Opera, Opera GX, Vivaldi, Yandex
ja: 対応ブラウザ：Chrome、Chrome Canary、Chromium、Edge、Firefox、Brave、Opera、Opera GX、Vivaldi、Yandex
zh_hans: 支持的浏览器：Chrome、Chrome Canary、Chromium、Edge、Firefox、Brave、Opera、Opera GX、Vivaldi、Yandex
zh_hant: 支援的瀏覽器：Chrome、Chrome Canary、Chromium、Edge、Firefox、Brave、Opera、Opera GX、Vivaldi、Yandex

source: Supports wildcards: * (single label) and ** (multi-level)
ja: ワイルドカード対応：*（単一レベル）と **（複数レベル）
zh_hans: 支持通配符：*（单级）和 **（多级）
zh_hant: 支援萬用字元：*（單層）和 **（多層）

source: System
ja: システム
zh_hans: 系统
zh_hant: 系統

source: System Default
ja: システムに従う
zh_hans: 跟随系统
zh_hant: 跟隨系統

source: Test URL...
ja: テスト URL...
zh_hans: 测试 URL...
zh_hant: 測試 URL...

source: The browser "%@" is no longer installed. Please update your rules in Preferences.
ja: ブラウザ「%@」はインストールされていません。環境設定でルールを更新してください。
zh_hans: 浏览器 "%@" 已不再安装。请在偏好设置中更新规则。
zh_hant: 瀏覽器 "%@" 已不再安裝。請在偏好設定中更新規則。

source: The language change will take effect after restarting BrowserRouter.
ja: 言語の変更は BrowserRouter を再起動後に反映されます。
zh_hans: 语言更改将在重启 BrowserRouter 后生效。
zh_hant: 語言更改將在重新啟動 BrowserRouter 後生效。

source: Tip: Use `**` at the end of a path to match all sub-paths and params.
ja: ヒント：パスの末尾に `**` を使うと、すべてのサブパスとパラメータに一致します。
zh_hans: 提示：在路径末尾使用 `**` 可匹配所有子路径和参数。
zh_hant: 提示：在路徑末尾使用 `**` 可匹配所有子路徑和參數。

source: Tip: Use `**` at the end of a path to match all sub-paths.
ja: ヒント：パスの末尾に `**` を使うと、すべてのサブパスに一致します。
zh_hans: 提示：在路径末尾使用 `**` 可匹配所有子路径。
zh_hant: 提示：在路徑末尾使用 `**` 可匹配所有子路徑。

source: URL Pattern
ja: URLパターン
zh_hans: URL 模式
zh_hant: URL 模式

source: URL Patterns (one per line)
ja: URLパターン（1行に1つ）
zh_hans: URL 模式（每行一个）
zh_hant: URL 模式（每行一個）

source: URL Rules
ja: URL ルール
zh_hans: URL 规则
zh_hant: URL 規則

source: Use `**` for domains with deep subdomains.
ja: 深いサブドメインには `**` を使用してください。
zh_hans: 多级子域名请使用 `**`。
zh_hant: 多層子網域請使用 `**`。

source: When no rule matches:
ja: ルールが一致しない場合：
zh_hans: 无规则匹配时：
zh_hant: 無規則匹配時：

source: Wildcard Reference
ja: ワイルドカードの説明
zh_hans: 通配符说明
zh_hant: 萬用字元說明

source: Without `?`, query params are ignored
ja: `?` がない場合、クエリパラメータは無視されます
zh_hans: 不含 `?` 时，查询参数会被忽略
zh_hant: 不含 `?` 時，查詢參數會被忽略

source: OK
zh_hans: 好
zh_hant: 好
